not complete 
#by ~ @VTVIT
#for ~ @iqub
roz = [
    "100% ئەو تۆی خۆشدەوێت و نیگەرانی تۆیە",
    "100% ئەو تۆی خۆشدەوێت و لە تۆ دەترسێت", 
    "91% بەشێک لەدڵی ",
    "81% ئەو بۆ تۆ دەمرێت هاهاها ",
    "81% ئەو بەم شێوەیە بۆ تۆ دەمرێت ", 
    "ها برا ؟  🏳‍🌈",
    "40% ئاژەڵێك و بەرژەوەندیەکەی باشە ",
    "50% ببینە چیت لەگەڵ ئەو هەیە",
    "30% خائین، هەستە، ئافەرم، سوودت پێناگەیەنێت",
    "25% کەسی تر هاوڕێت ناکات و دەڵێت خۆشم دەوێیت",
    "25% سەگی کوڕی سەگ بەجێیهێشت", 
    "0% ڕقی لێتە ",
    "0% ڕقی لێتە ", 
]

rr7 = [
    "100%",
    "90%",
    "80%",
    "70%",
    "60%",
    "50%",
    "40%",
    "30%",
    "20%",
    "10%",
    "0%",
]
