
ALIVERZ = "**• فەرمانی پشکنین **:\n\n- بەکارهێنان  : بەکاردێت بۆ دڵنیابوون لە چالاکی بۆتەکە وەك فەرمانێکی تاقیکردنەوە   \n\n- بەکارهێنان  :  لە هەر گفتوگۆیەکدا بنێرە   `.پشکنین`"
Trfehn = "•❒ فەرمانی چێژبەخش وزیادەڕەوی\n\n`.وەسفکردن`        .هينه`      `.كت`    `.ئێمە`\n\n`.تەڵاق`    `.رفع مطي`    `.بەرزکردنەوەی هاوسەرگیری`\n\n`.رفع مرتي`      `.بەرزکردنەوەی تاج`   `.نسبة الانوثة`\n\n`.ڕێژەی گەمژە`    `.ڕێژەی خۆشەویستی`   `.بەرزکردنەوەی مەیمون`\n\n`.بەرزکردنەوەی هێنان`     `.بەرزکردنەوەی دڵم`\n\nٴ╼──────────────────╾\n\nهەموو ئەم فەرمانانە بەکاردێن بە وەڵامدانەوەی بەکارهێنەرەکە🕷️🖤."
RAZAN = "**▾∮ پێویستە ناوی گۆرانییەکە سەرەتا بۆ گەڕان بێت،15**"
